#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.client-roles.keycloak_role.ROLES["EDRD_Physicians"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_Physicians"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.client-roles.keycloak_role.ROLES["EDRD_Reviewers"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_Reviewers"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.client-roles.keycloak_role.ROLES["EDRD_Super_Users"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "EDRD_Super_Users"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MD"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "2a654d48-f695-4d2c-8eb0-d47cd50b8ec9"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MOA"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "6bc1847c-432e-48a8-bf39-efafd1aa2fe8"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/PRACTITIONER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "27a96e6f-ab21-4bac-873e-d80c851aea01"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-PORTAL.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/RNP"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "23da7b3a-b666-4cb8-b04c-00d2d226ce2d"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-edrd-portal"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-edrd-portal"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-edrd-portal"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD.module.client-roles.keycloak_role.ROLES["EDRD_Reviewers"] will be destroyed
  # (because key ["EDRD_Reviewers"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "4972d3e8-1c2e-4886-b066-02e2fc43cb2c" -> null
      - id         = "acc33369-338e-4a19-94a8-739c8c964697" -> null
      - name       = "EDRD_Reviewers" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EDRD-PORTAL.module.client-roles.keycloak_role.ROLES["EDRD_Reviewers"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ec28ad26-876d-4f72-aeb7-3b7932a43c26"
      + id        = (known after apply)
      + name      = "EDRD_Reviewers"
      + realm_id  = "moh_applications"
    }

Plan: 16 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*